ab_test_result.txt
zhuyuefeng:Listen-now zhuluchi$ ab -n 900 -c 100 -p "ab_test.txt" http://112.16.96.15/search

This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/


Benchmarking 112.16.96.15 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Finished 900 requests


Server Software:        python
Server Hostname:        112.16.96.15
Server Port:            80

Document Path:          /search
Document Length:        4755 bytes

Concurrency Level:      100
Time taken for tests:   16.566 seconds
Complete requests:      900
Failed requests:        0
Total transferred:      4415400 bytes
Total body sent:        161100
HTML transferred:       4279500 bytes
Requests per second:    54.33 [#/sec] (mean)
Time per request:       1840.629 [ms] (mean)
Time per request:       18.406 [ms] (mean, across all concurrent requests)
Transfer rate:          260.29 [Kbytes/sec] received
                        9.50 kb/s sent
                        269.79 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  379 1123.0      4    4285
Processing:   111 1326 391.3   1510    1735
Waiting:      111 1326 391.2   1510    1735
Total:        254 1705 972.2   1525    5688

Percentage of the requests served within a certain time (ms)
  50%   1525
  66%   1544
  75%   1560
  80%   1575
  90%   2259
  95%   4360
  98%   5186
  99%   5452
 100%   5688 (longest request)